chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/tmr/processor/tmr_p32mz2048ech124.h
PLIB_INLINE_API void PLIB_TMR_StopInIdleEnable(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            TMR_StopInIdleEnable_Default(index);
            break;
        case TMR_ID_2 :
            TMR_StopInIdleEnable_Default(index);
            break;
        case TMR_ID_4 :
            TMR_StopInIdleEnable_Default(index);
            break;
        case TMR_ID_6 :
            TMR_StopInIdleEnable_Default(index);
            break;
        case TMR_ID_8 :
            TMR_StopInIdleEnable_Default(index);
            break;
        case TMR_ID_3 :
            TMR_StopInIdleEnable_Default(index);
            break;
        case TMR_ID_5 :
            TMR_StopInIdleEnable_Default(index);
            break;
        case TMR_ID_7 :
            TMR_StopInIdleEnable_Default(index);
            break;
        case TMR_ID_9 :
            TMR_StopInIdleEnable_Default(index);
            break;
        case TMR_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_TMR_StopInIdleDisable(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            TMR_StopInIdleDisable_Default(index);
            break;
        case TMR_ID_2 :
            TMR_StopInIdleDisable_Default(index);
            break;
        case TMR_ID_4 :
            TMR_StopInIdleDisable_Default(index);
            break;
        case TMR_ID_6 :
            TMR_StopInIdleDisable_Default(index);
            break;
        case TMR_ID_8 :
            TMR_StopInIdleDisable_Default(index);
            break;
        case TMR_ID_3 :
            TMR_StopInIdleDisable_Default(index);
            break;
        case TMR_ID_5 :
            TMR_StopInIdleDisable_Default(index);
            break;
        case TMR_ID_7 :
            TMR_StopInIdleDisable_Default(index);
            break;
        case TMR_ID_9 :
            TMR_StopInIdleDisable_Default(index);
            break;
        case TMR_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_TMR_ExistsStopInIdleControl(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_ExistsStopInIdleControl_Default(index);
        case TMR_ID_2 :
            return TMR_ExistsStopInIdleControl_Default(index);
        case TMR_ID_4 :
            return TMR_ExistsStopInIdleControl_Default(index);
        case TMR_ID_6 :
            return TMR_ExistsStopInIdleControl_Default(index);
        case TMR_ID_8 :
            return TMR_ExistsStopInIdleControl_Default(index);
        case TMR_ID_3 :
            return TMR_ExistsStopInIdleControl_Default(index);
        case TMR_ID_5 :
            return TMR_ExistsStopInIdleControl_Default(index);
        case TMR_ID_7 :
            return TMR_ExistsStopInIdleControl_Default(index);
        case TMR_ID_9 :
            return TMR_ExistsStopInIdleControl_Default(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_TMR_Counter16BitSet(TMR_MODULE_ID index, uint16_t value)
{
    switch (index) {
        case TMR_ID_1 :
            TMR_Counter16BitSet_In16BitRegister(index, value);
            break;
        case TMR_ID_2 :
            TMR_Counter16BitSet_In16BitRegister(index, value);
            break;
        case TMR_ID_4 :
            TMR_Counter16BitSet_In16BitRegister(index, value);
            break;
        case TMR_ID_6 :
            TMR_Counter16BitSet_In16BitRegister(index, value);
            break;
        case TMR_ID_8 :
            TMR_Counter16BitSet_In16BitRegister(index, value);
            break;
        case TMR_ID_3 :
            TMR_Counter16BitSet_In16BitRegister(index, value);
            break;
        case TMR_ID_5 :
            TMR_Counter16BitSet_In16BitRegister(index, value);
            break;
        case TMR_ID_7 :
            TMR_Counter16BitSet_In16BitRegister(index, value);
            break;
        case TMR_ID_9 :
            TMR_Counter16BitSet_In16BitRegister(index, value);
            break;
        case TMR_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint16_t PLIB_TMR_Counter16BitGet(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_Counter16BitGet_In16BitRegister(index);
        case TMR_ID_2 :
            return TMR_Counter16BitGet_In16BitRegister(index);
        case TMR_ID_4 :
            return TMR_Counter16BitGet_In16BitRegister(index);
        case TMR_ID_6 :
            return TMR_Counter16BitGet_In16BitRegister(index);
        case TMR_ID_8 :
            return TMR_Counter16BitGet_In16BitRegister(index);
        case TMR_ID_3 :
            return TMR_Counter16BitGet_In16BitRegister(index);
        case TMR_ID_5 :
            return TMR_Counter16BitGet_In16BitRegister(index);
        case TMR_ID_7 :
            return TMR_Counter16BitGet_In16BitRegister(index);
        case TMR_ID_9 :
            return TMR_Counter16BitGet_In16BitRegister(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (uint16_t)0;
    }
}

PLIB_INLINE_API void PLIB_TMR_Counter16BitClear(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            TMR_Counter16BitClear_In16BitRegister(index);
            break;
        case TMR_ID_2 :
            TMR_Counter16BitClear_In16BitRegister(index);
            break;
        case TMR_ID_4 :
            TMR_Counter16BitClear_In16BitRegister(index);
            break;
        case TMR_ID_6 :
            TMR_Counter16BitClear_In16BitRegister(index);
            break;
        case TMR_ID_8 :
            TMR_Counter16BitClear_In16BitRegister(index);
            break;
        case TMR_ID_3 :
            TMR_Counter16BitClear_In16BitRegister(index);
            break;
        case TMR_ID_5 :
            TMR_Counter16BitClear_In16BitRegister(index);
            break;
        case TMR_ID_7 :
            TMR_Counter16BitClear_In16BitRegister(index);
            break;
        case TMR_ID_9 :
            TMR_Counter16BitClear_In16BitRegister(index);
            break;
        case TMR_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_TMR_ExistsCounter16Bit(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_ExistsCounter16Bit_In16BitRegister(index);
        case TMR_ID_2 :
            return TMR_ExistsCounter16Bit_In16BitRegister(index);
        case TMR_ID_4 :
            return TMR_ExistsCounter16Bit_In16BitRegister(index);
        case TMR_ID_6 :
            return TMR_ExistsCounter16Bit_In16BitRegister(index);
        case TMR_ID_8 :
            return TMR_ExistsCounter16Bit_In16BitRegister(index);
        case TMR_ID_3 :
            return TMR_ExistsCounter16Bit_In16BitRegister(index);
        case TMR_ID_5 :
            return TMR_ExistsCounter16Bit_In16BitRegister(index);
        case TMR_ID_7 :
            return TMR_ExistsCounter16Bit_In16BitRegister(index);
        case TMR_ID_9 :
            return TMR_ExistsCounter16Bit_In16BitRegister(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_TMR_Counter32BitSet(TMR_MODULE_ID index, uint32_t value)
{
    switch (index) {
        case TMR_ID_1 :
            TMR_Counter32BitSet_Unsupported(index, value);
            break;
        case TMR_ID_2 :
            TMR_Counter32BitSet_In16BitRegister(index, value);
            break;
        case TMR_ID_4 :
            TMR_Counter32BitSet_In16BitRegister(index, value);
            break;
        case TMR_ID_6 :
            TMR_Counter32BitSet_In16BitRegister(index, value);
            break;
        case TMR_ID_8 :
            TMR_Counter32BitSet_In16BitRegister(index, value);
            break;
        case TMR_ID_3 :
            TMR_Counter32BitSet_In16BitRegister_high(index, value);
            break;
        case TMR_ID_5 :
            TMR_Counter32BitSet_In16BitRegister_high(index, value);
            break;
        case TMR_ID_7 :
            TMR_Counter32BitSet_In16BitRegister_high(index, value);
            break;
        case TMR_ID_9 :
            TMR_Counter32BitSet_In16BitRegister_high(index, value);
            break;
        case TMR_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint32_t PLIB_TMR_Counter32BitGet(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_Counter32BitGet_Unsupported(index);
        case TMR_ID_2 :
            return TMR_Counter32BitGet_In16BitRegister(index);
        case TMR_ID_4 :
            return TMR_Counter32BitGet_In16BitRegister(index);
        case TMR_ID_6 :
            return TMR_Counter32BitGet_In16BitRegister(index);
        case TMR_ID_8 :
            return TMR_Counter32BitGet_In16BitRegister(index);
        case TMR_ID_3 :
            return TMR_Counter32BitGet_In16BitRegister_high(index);
        case TMR_ID_5 :
            return TMR_Counter32BitGet_In16BitRegister_high(index);
        case TMR_ID_7 :
            return TMR_Counter32BitGet_In16BitRegister_high(index);
        case TMR_ID_9 :
            return TMR_Counter32BitGet_In16BitRegister_high(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (uint32_t)0;
    }
}

PLIB_INLINE_API void PLIB_TMR_Counter32BitClear(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            TMR_Counter32BitClear_Unsupported(index);
            break;
        case TMR_ID_2 :
            TMR_Counter32BitClear_In16BitRegister(index);
            break;
        case TMR_ID_4 :
            TMR_Counter32BitClear_In16BitRegister(index);
            break;
        case TMR_ID_6 :
            TMR_Counter32BitClear_In16BitRegister(index);
            break;
        case TMR_ID_8 :
            TMR_Counter32BitClear_In16BitRegister(index);
            break;
        case TMR_ID_3 :
            TMR_Counter32BitClear_In16BitRegister_high(index);
            break;
        case TMR_ID_5 :
            TMR_Counter32BitClear_In16BitRegister_high(index);
            break;
        case TMR_ID_7 :
            TMR_Counter32BitClear_In16BitRegister_high(index);
            break;
        case TMR_ID_9 :
            TMR_Counter32BitClear_In16BitRegister_high(index);
            break;
        case TMR_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_TMR_ExistsCounter32Bit(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_ExistsCounter32Bit_Unsupported(index);
        case TMR_ID_2 :
            return TMR_ExistsCounter32Bit_In16BitRegister(index);
        case TMR_ID_4 :
            return TMR_ExistsCounter32Bit_In16BitRegister(index);
        case TMR_ID_6 :
            return TMR_ExistsCounter32Bit_In16BitRegister(index);
        case TMR_ID_8 :
            return TMR_ExistsCounter32Bit_In16BitRegister(index);
        case TMR_ID_3 :
            return TMR_ExistsCounter32Bit_In16BitRegister_high(index);
        case TMR_ID_5 :
            return TMR_ExistsCounter32Bit_In16BitRegister_high(index);
        case TMR_ID_7 :
            return TMR_ExistsCounter32Bit_In16BitRegister_high(index);
        case TMR_ID_9 :
            return TMR_ExistsCounter32Bit_In16BitRegister_high(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_TMR_Period16BitSet(TMR_MODULE_ID index, uint16_t period)
{
    switch (index) {
        case TMR_ID_1 :
            TMR_Period16BitSet_Default(index, period);
            break;
        case TMR_ID_2 :
            TMR_Period16BitSet_Default(index, period);
            break;
        case TMR_ID_4 :
            TMR_Period16BitSet_Default(index, period);
            break;
        case TMR_ID_6 :
            TMR_Period16BitSet_Default(index, period);
            break;
        case TMR_ID_8 :
            TMR_Period16BitSet_Default(index, period);
            break;
        case TMR_ID_3 :
            TMR_Period16BitSet_Default(index, period);
            break;
        case TMR_ID_5 :
            TMR_Period16BitSet_Default(index, period);
            break;
        case TMR_ID_7 :
            TMR_Period16BitSet_Default(index, period);
            break;
        case TMR_ID_9 :
            TMR_Period16BitSet_Default(index, period);
            break;
        case TMR_NUMBER_OF_MODULES :
        default :
            break;
    }
}

